kylefoxaustin/mcxn947qemu/hw/timer/mcxn_ctimer.c
/*
 * NXP MCX N CTIMER (Standard counter/timer) — functional core.  See header.
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */
#include "qemu/osdep.h"
#include "qemu/log.h"
#include "hw/timer/mcxn_ctimer.h"
#include "hw/core/irq.h"
#include "hw/core/qdev.h"
#include "hw/core/qdev-clock.h"
#include "migration/vmstate.h"

/* Register offsets (CMSIS CTIMER_Type). */
#define R_IR    0x00
#define R_TCR   0x04
#define R_TC    0x08
#define R_PR    0x0C
#define R_PC    0x10
#define R_MCR   0x14
#define R_MR0   0x18    /* MR0..3  @0x18..0x24 */
#define R_CCR   0x28
#define R_CR0   0x2C    /* CR0..3  @0x2C..0x38 */
#define R_EMR   0x3C
#define R_CTCR  0x70
#define R_PWMC  0x74
#define R_MSR0  0x78    /* MSR0..3 @0x78..0x84 */

#define TCR_CEN   (1u << 0)
#define TCR_CRST  (1u << 1)

/* MCR packs 3 bits per match: INT (interrupt), RST (reset TC), STOP. */
#define MCR_INT(n)   (1u << (3 * (n) + 0))
#define MCR_RST(n)   (1u << (3 * (n) + 1))
#define MCR_STOP(n)  (1u << (3 * (n) + 2))
#define MCR_ANY(n)   (MCR_INT(n) | MCR_RST(n) | MCR_STOP(n))

/* CCR packs 3 bits per capture channel: RE (capture on rising), FE (falling), I (interrupt). */
#define CCR_CAP0RE   (1u << 0)
#define CCR_CAP0FE   (1u << 1)
#define CCR_CAP0I    (1u << 2)
/* IR capture flags: CR0INT..CR3INT at bits 4..7 (match flags MR0..3 are 0..3). */
#define IR_CR0INT    (1u << 4)

static bool ctimer_running(MCXNCTimerState *s)
{
    return (s->tcr & TCR_CEN) && !(s->tcr & TCR_CRST);
}

static uint32_t ctimer_freq(MCXNCTimerState *s)
{
    /*
     * ⚠ THIS USED TO BE:  return hz ? hz : 150000000;
     *                     -- "fallback if the clock tree isn't driven"
     *
     * The clock tree WAS not driven, so the fallback fired always and the CTIMER ran
     * at sysclk regardless of SYSCON[CTIMERCLKSEL].  Real firmware does
     * CLOCK_AttachClk(kFRO_HF_to_CTIMER0), computes its match values from
     * CLOCK_GetCTimerClkFreq() = 48 MHz, and we ticked it at 150 MHz -- EVERY CTIMER
     * DELAY 3.1x TOO SHORT, silently.  Measured with SysTick before the fix: 12011
     * ticks where the SDK's own arithmetic expects 150000.
     *
     * THE FALLBACK WAS THE CAMOUFLAGE, and it even said so in its own comment: it
     * announced that the clock tree might not be driven, and then quietly made that
     * fact invisible.  There is no default now.  0 Hz means NO CLOCK SELECTED (which
     * is CTIMERCLKSEL's reset state) and a timer with no clock DOES NOT RUN.
     */
    return s->clk ? clock_get_hz(s->clk) : 0;
}

/* Live tc/pc at time `now`, without committing to state. */
static void ctimer_peek(MCXNCTimerState *s, int64_t now,
                        uint32_t *tc, uint32_t *pc)
{
    uint64_t elapsed, pclk, total;
    uint32_t div;

    *tc = s->tc;
    *pc = s->pc;
    if (!ctimer_running(s) || now <= s->base_ns) {
        return;
    }
    div = s->pr + 1;
    elapsed = now - s->base_ns;
    pclk = (elapsed * ctimer_freq(s)) / 1000000000ULL;
    total = (uint64_t)s->pc + pclk;
    *tc = s->tc + (uint32_t)(total / div);
    *pc = (uint32_t)(total % div);
}

static void ctimer_sync(MCXNCTimerState *s, int64_t now)
{
    ctimer_peek(s, now, &s->tc, &s->pc);
    s->base_ns = now;
}

static void ctimer_update_irq(MCXNCTimerState *s)
{
    qemu_set_irq(s->irq, s->ir != 0);
}

/* Arm the host timer for the soonest match that has an action. */
static void ctimer_reschedule(MCXNCTimerState *s, int64_t now)
{
    uint32_t div = s->pr + 1;
    uint32_t freq = ctimer_freq(s);
    uint64_t best = UINT64_MAX;
    int n;

    timer_del(&s->timer);
    if (!ctimer_running(s)) {
        return;
    }
    for (n = 0; n < 4; n++) {
        uint64_t dtc, clocks, ns;

        if (!(s->mcr & MCR_ANY(n))) {
            continue;
        }
        dtc = (s->mr[n] >= s->tc) ? (s->mr[n] - s->tc)
                                  : ((1ULL << 32) - s->tc + s->mr[n]);
        clocks = dtc * div;
        clocks = (clocks > s->pc) ? clocks - s->pc : 1;
        ns = (clocks * 1000000000ULL) / freq;
        if (ns < best) {
            best = ns;
        }
    }
    if (best != UINT64_MAX) {
        timer_mod(&s->timer, now + (int64_t)(best ? best : 1));
    }
}

static void ctimer_tick(void *opaque)
{
    MCXNCTimerState *s = opaque;
    int64_t now = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    uint64_t best_dtc = UINT64_MAX;
    int n, fire = -1;

    ctimer_sync(s, now);

    /* The soonest active match is the one firing now; snap TC to it exactly to
     * avoid sub-tick rounding error. */
    for (n = 0; n < 4; n++) {
        uint64_t dtc;

        if (!(s->mcr & MCR_ANY(n))) {
            continue;
        }
        dtc = (s->mr[n] >= s->tc) ? (s->mr[n] - s->tc)
                                  : ((1ULL << 32) - s->tc + s->mr[n]);
        if (dtc < best_dtc) {
            best_dtc = dtc;
            fire = n;
        }
    }
    if (fire >= 0) {
        bool do_reset = false;

        s->tc = s->mr[fire];
        s->pc = 0;
        for (n = 0; n < 4; n++) {            /* all matches at this TC value */
            if ((s->mcr & MCR_ANY(n)) && s->mr[n] == s->tc) {
                if (s->mcr & MCR_INT(n)) {
                    s->ir |= (1u << n);
                }
                if (s->mcr & MCR_STOP(n)) {
                    s->tcr &= ~TCR_CEN;
                }
                if (s->mcr & MCR_RST(n)) {
                    do_reset = true;
                }
                /*
                 * Match 0 and match 1 each drive an eDMA request line (CMSIS
                 * CTIMER{k} M0/M1).  The match event itself raises the request --
                 * the CTIMER has no DMA-enable bit of its own; INPUTMUX gates it
                 * (modelled in the eDMA as req_enabled[]).  It is a one-shot PULSE:
                 * one match, one minor loop.  (A match that ONLY drives DMA with no
                 * MCR action is not scheduled by this model -- but a DMA-pacing timer
                 * is periodic, i.e. sets MCR_RST, so it lands here.) */
                if (n < 2) {
                    qemu_irq_pulse(s->dma_req[n]);
                }
                /*
                 * Every match also emits a one-shot trigger EVENT that INPUTMUX can
                 * route to an ADCn_TRIG selector (kINPUTMUX_Ctimer{k}M3ToAdc0Trigger
                 * = selector 5+k in NXP's driver).  This is the "sample the ADC on a
                 * timer match" path: a periodic match (MCR[MRnR] set) paces conversions
                 * with zero CPU involvement -- exactly like the DMA request above, but
                 * feeding the ADC's HTEN-gated trigger input instead of the eDMA.  It is
                 * an EDGE, so a pulse: one match, one conversion.
                 */
                qemu_irq_pulse(s->match_trig[n]);
            }
        }
        if (do_reset) {
            s->tc = 0;
            s->pc = 0;
        }
        s->base_ns = now;
    }
    ctimer_update_irq(s);
    ctimer_reschedule(s, now);
}

/*
 * INPUT CAPTURE on channel 0.  A capture input (a pin, routed via INPUTMUX's CTIMERnCAPm
 * selector) with a CCR-selected edge LATCHES the live timer counter into CR0 -- the
 * "timestamp an external event / measure a pulse width" path.  It was dead: CR0..3 were
 * read-only storage that nothing ever loaded, so a capture driver read a frozen zero.
 *
 * The pin has no signal source in emulation, so its level is OPERATOR-DRIVEN via the
 * "capture-input" QOM property (the same seam as FlexPWM's capture-a-input / the CMP output).
 * CCR[CAP0RE]/[CAP0FE] select which edge captures; CCR[CAP0I] gates the capture interrupt
 * (IR[CR0INT]).  The CR0 load itself happens on the selected edge regardless of CAP0I -- the
 * interrupt is separate from the capture, exactly as on silicon.
 *
 * ⚠ Scope, stated: capture channel 0 only (channels 1..3 share the identical per-channel CCR
 * logic but have no injection seam); the counter-input / CTCR edge-count modes are unmodelled.
 */
static void ctimer_capture0(MCXNCTimerState *s, bool level)
{
    int64_t now = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    bool rising = level && !s->cap0_level;
    bool falling = !level && s->cap0_level;
    uint32_t tc, pc;

    s->cap0_level = level;

    if ((rising && (s->ccr & CCR_CAP0RE)) || (falling && (s->ccr & CCR_CAP0FE))) {
        ctimer_peek(s, now, &tc, &pc);       /* the counter value AT the edge */
        s->cr[0] = tc;                       /* latch it into CR0 (RO to the guest) */
        if (s->ccr & CCR_CAP0I) {
            s->ir |= IR_CR0INT;
            ctimer_update_irq(s);
        }
    }
}

static void ctimer_set_capture(Object *obj, bool value, Error **errp)
{
    ctimer_capture0(MCXN_CTIMER(obj), value);
}

static bool ctimer_get_capture(Object *obj, Error **errp)
{
    return MCXN_CTIMER(obj)->cap0_level;
}

static uint64_t ctimer_read(void *opaque, hwaddr off, unsigned size)
{
    MCXNCTimerState *s = MCXN_CTIMER(opaque);
    int64_t now = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    uint32_t tc, pc;

    switch (off) {
    case R_IR:   return s->ir;
    case R_TCR:  return s->tcr;
    case R_TC:
        ctimer_peek(s, now, &tc, &pc);
        return tc;
    case R_PR:   return s->pr;
    case R_PC:
        ctimer_peek(s, now, &tc, &pc);
        return pc;
    case R_MCR:  return s->mcr;
    case R_MR0: case R_MR0 + 4: case R_MR0 + 8: case R_MR0 + 12:
        return s->mr[(off - R_MR0) / 4];
    case R_CCR:  return s->ccr;
    case R_CR0: case R_CR0 + 4: case R_CR0 + 8: case R_CR0 + 12:
        return s->cr[(off - R_CR0) / 4];
    case R_EMR:  return s->emr;
    case R_CTCR: return s->ctcr;
    case R_PWMC: return s->pwmc;
    case R_MSR0: case R_MSR0 + 4: case R_MSR0 + 8: case R_MSR0 + 12:
        return s->msr[(off - R_MSR0) / 4];
    default:
        return 0;
    }
}

static void ctimer_write(void *opaque, hwaddr off, uint64_t val, unsigned size)
{
    MCXNCTimerState *s = MCXN_CTIMER(opaque);
    int64_t now = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    uint32_t v = val;

    switch (off) {
    case R_IR:                         /* write-1-to-clear */
        s->ir &= ~v;
        ctimer_update_irq(s);
        return;
    case R_TCR:
        ctimer_sync(s, now);
        s->tcr = v & 0xFF;
        if (s->tcr & TCR_CRST) {
            s->tc = 0;
            s->pc = 0;
        }
        ctimer_reschedule(s, now);
        return;
    case R_TC:
        ctimer_sync(s, now);
        s->tc = v;
        ctimer_reschedule(s, now);
        return;
    case R_PR:
        ctimer_sync(s, now);
        s->pr = v;
        ctimer_reschedule(s, now);
        return;
    case R_PC:
        ctimer_sync(s, now);
        s->pc = v;
        ctimer_reschedule(s, now);
        return;
    case R_MCR:
        ctimer_sync(s, now);
        s->mcr = v;
        ctimer_reschedule(s, now);
        return;
    case R_MR0: case R_MR0 + 4: case R_MR0 + 8: case R_MR0 + 12:
        ctimer_sync(s, now);
        s->mr[(off - R_MR0) / 4] = v;
        ctimer_reschedule(s, now);
        return;
    case R_CCR:
        s->ccr = v;
        return;
    case R_CR0: case R_CR0 + 4: case R_CR0 + 8: case R_CR0 + 12:
        return;                        /* capture registers are read-only */
    case R_EMR:
        s->emr = v;
        return;
    case R_CTCR:
        s->ctcr = v;
        return;
    case R_PWMC:
        s->pwmc = v;
        return;
    case R_MSR0: case R_MSR0 + 4: case R_MSR0 + 8: case R_MSR0 + 12:
        s->msr[(off - R_MSR0) / 4] = v;
        return;
    default:
        return;
    }
}

static const MemoryRegionOps ctimer_ops = {
    .read = ctimer_read,
    .write = ctimer_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid.min_access_size = 4,
    .valid.max_access_size = 4,
    .impl.min_access_size = 4,
    .impl.max_access_size = 4,
};

static void mcxn_ctimer_reset(DeviceState *dev)
{
    MCXNCTimerState *s = MCXN_CTIMER(dev);

    timer_del(&s->timer);
    s->ir = s->tcr = s->pr = s->mcr = 0;
    s->ccr = s->emr = s->ctcr = s->pwmc = 0;
    memset(s->mr, 0, sizeof(s->mr));
    memset(s->cr, 0, sizeof(s->cr));
    memset(s->msr, 0, sizeof(s->msr));
    s->tc = s->pc = 0;
    s->base_ns = 0;
    s->cap0_level = false;
}

static void mcxn_ctimer_init(Object *obj)
{
    MCXNCTimerState *s = MCXN_CTIMER(obj);

    s->clk = qdev_init_clock_in(DEVICE(obj), "clk", NULL, NULL, 0);
    /* Operator-driven capture-0 input pin:
     *   qom-set /machine/soc/ctimer0 capture-input true   */
    object_property_add_bool(obj, "capture-input",
                             ctimer_get_capture, ctimer_set_capture);
}

static void mcxn_ctimer_realize(DeviceState *dev, Error **errp)
{
    MCXNCTimerState *s = MCXN_CTIMER(dev);

    memory_region_init_io(&s->iomem, OBJECT(s), &ctimer_ops, s,
                          TYPE_MCXN_CTIMER, 0x1000);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->iomem);
    sysbus_init_irq(SYS_BUS_DEVICE(dev), &s->irq);          /* 0: NVIC match interrupt */
    sysbus_init_irq(SYS_BUS_DEVICE(dev), &s->dma_req[0]);   /* 1: match-0 eDMA request */
    sysbus_init_irq(SYS_BUS_DEVICE(dev), &s->dma_req[1]);   /* 2: match-1 eDMA request */
    /* Per-match trigger EVENT outputs, routed by INPUTMUX to the ADC trigger inputs. */
    qdev_init_gpio_out_named(dev, s->match_trig, "match-trig", 4);
    timer_init_ns(&s->timer, QEMU_CLOCK_VIRTUAL, ctimer_tick, s);
}

static const VMStateDescription vmstate_mcxn_ctimer = {
    .name = TYPE_MCXN_CTIMER,
    .version_id = 2,
    .minimum_version_id = 2,
    .fields = (const VMStateField[]) {
        VMSTATE_TIMER(timer, MCXNCTimerState),
        VMSTATE_UINT32(ir, MCXNCTimerState),
        VMSTATE_UINT32(tcr, MCXNCTimerState),
        VMSTATE_UINT32(pr, MCXNCTimerState),
        VMSTATE_UINT32(mcr, MCXNCTimerState),
        VMSTATE_UINT32_ARRAY(mr, MCXNCTimerState, 4),
        VMSTATE_UINT32(ccr, MCXNCTimerState),
        VMSTATE_UINT32(emr, MCXNCTimerState),
        VMSTATE_UINT32(ctcr, MCXNCTimerState),
        VMSTATE_UINT32(pwmc, MCXNCTimerState),
        VMSTATE_UINT32_ARRAY(cr, MCXNCTimerState, 4),
        VMSTATE_UINT32_ARRAY(msr, MCXNCTimerState, 4),
        VMSTATE_UINT32(tc, MCXNCTimerState),
        VMSTATE_UINT32(pc, MCXNCTimerState),
        VMSTATE_INT64(base_ns, MCXNCTimerState),
        VMSTATE_BOOL(cap0_level, MCXNCTimerState),
        VMSTATE_END_OF_LIST()
    },
};

static void mcxn_ctimer_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = mcxn_ctimer_realize;
    device_class_set_legacy_reset(dc, mcxn_ctimer_reset);
    dc->vmsd = &vmstate_mcxn_ctimer;
}

static const TypeInfo mcxn_ctimer_types[] = {
    {
        .name          = TYPE_MCXN_CTIMER,
        .parent        = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(MCXNCTimerState),
        .instance_init = mcxn_ctimer_init,
        .class_init    = mcxn_ctimer_class_init,
    },
};

DEFINE_TYPES(mcxn_ctimer_types)
